papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/3dTube/base/monolithic/system/functions
functions
{
    displacement
    {
        type            solidPointDisplacement;
        region          solid;
        point           (0 0.005 0.025);
    }
    solidForce
    {
        type           solidForces;
        historyPatch   inner-wall;
    }
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        writeControl        timeStep;
        writeInterval       1;
        patches             (wall);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
        region              fluid;
    }
    fsiConvData
    {
        type fsiConvergenceData;
        region fluid;
    }
}
